#include <Servo.h> 
Servo myservo;        //创建一个舵机控制对象
                         // Arduino自带的Servo函数库只可以同时控制两个模拟舵机；
                         //且最好使用D9 D10脚；
                         //若需要控制多个舵机则需要用pwm功能；
                         //使用Servo类最多可以控制8个舵机
int pos = 0;          // 该变量（pos）用于存储舵机角度位置
/*~~~~~~~~~~~~~~~~~~~~~~~~~~朴实的分割线~~~~~~~~~~~~~~~~~~~~~~~~~~ */
void setup() 
{ 
  myservo.attach(9);     // 该舵机由arduino第九脚控制
} 
/*~~~~~~~~~~~~~~~~~~~~~~~~~~朴实的分割线 ~~~~~~~~~~~~~~~~~~~~~~~~~~ */ 
void loop() 
{ 
  for(pos = 0; pos < 180; pos += 1)  // 从0°到180°运动 
  {                                 // 每次步进一度，实际会有些偏差属正常现象
    myservo.write(pos);           // 指定舵机转向的角度
    delay(15);                      // 等待15ms让舵机到达指定位置
  } 
  for(pos = 180; pos>=1; pos-=1)   //从180°到0°运动  
  {                                
    myservo.write(pos);           // 指定舵机转向的角度 
    delay(15);                      // 等待15ms让舵机到达指定位置 
  } 
  //myservo.write(pos);   //注释主函数的内容，取消注释此内容
  //将pos换为具体的0到180间任意数，上电可直接让舵机转到该位置
}
